In [164]:
import pandas as pd

In [165]:
lst=[3,4,5,6,7,8]
lst

[3, 4, 5, 6, 7, 8]

In [166]:
pd.DataFrame(lst)

   0
0  3
1  4
2  5
3  6
4  7
5  8

In [167]:
pd.DataFrame([[1,2],[3,4],[5,6],[7,8]])

   0  1
0  1  2
1  3  4
2  5  6
3  7  8

In [168]:
data={'Name':['Sourav','Kritartha','Thakur'],'Age':[22,22,22],'Address':['Punjab','Gujrat','Assam']}
data

{'Name': ['Sourav', 'Kritartha', 'Thakur'],
 'Age': [22, 22, 22],
 'Address': ['Punjab', 'Gujrat', 'Assam']}

In [169]:
df=pd.DataFrame(data)

In [170]:
df

        Name  Age Address
0     Sourav   22  Punjab
1  Kritartha   22  Gujrat
2     Thakur   22   Assam

In [171]:
df[['Name','Address']]

        Name Address
0     Sourav  Punjab
1  Kritartha  Gujrat
2     Thakur   Assam

In [172]:
df.loc[0:0]

     Name  Age Address
0  Sourav   22  Punjab

In [173]:
df.iloc[:2][['Name','Address']]

        Name Address
0     Sourav  Punjab
1  Kritartha  Gujrat

In [174]:
df.iloc[:,0:1]#all the rows and only the first column

        Name
0     Sourav
1  Kritartha
2     Thakur

In [175]:
df['Age']>20

0    True
1    True
2    True
Name: Age, dtype: bool

In [176]:
df.loc[df['Age']>20,['Name','Address']]

        Name Address
0     Sourav  Punjab
1  Kritartha  Gujrat
2     Thakur   Assam

In [177]:
df.iloc[[0,2],[0,2]]

     Name Address
0  Sourav  Punjab
2  Thakur   Assam

In [178]:
df

        Name  Age Address
0     Sourav   22  Punjab
1  Kritartha   22  Gujrat
2     Thakur   22   Assam

In [179]:
l=[0,1,3]

In [180]:
df['Work Experience']=l
df

        Name  Age Address  Work Experience
0     Sourav   22  Punjab                0
1  Kritartha   22  Gujrat                1
2     Thakur   22   Assam                3

In [181]:
df['New Age']=df['Age']+1

In [182]:
df

        Name  Age Address  Work Experience  New Age
0     Sourav   22  Punjab                0       23
1  Kritartha   22  Gujrat                1       23
2     Thakur   22   Assam                3       23

In [183]:
del df['Age']

In [184]:
df

        Name Address  Work Experience  New Age
0     Sourav  Punjab                0       23
1  Kritartha  Gujrat                1       23
2     Thakur   Assam                3       23

In [185]:
df.pop('Work Experience')

0    0
1    1
2    3
Name: Work Experience, dtype: int64

In [186]:
df

        Name Address  New Age
0     Sourav  Punjab       23
1  Kritartha  Gujrat       23
2     Thakur   Assam       23

In [187]:
p=pd.DataFrame([[1,2],[3,4]],columns=['a','b'])
q=pd.DataFrame([[5,6],[7,8]],columns=['a','b'])

In [188]:
p

   a  b
0  1  2
1  3  4

In [189]:
q

   a  b
0  5  6
1  7  8

In [190]:
p.append(q).reset_index(drop=True)

C:\Users\hp\AppData\Local\Temp\ipykernel_676\1845412369.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  p.append(q).reset_index(drop=True)

   a  b
0  1  2
1  3  4
2  5  6
3  7  8

In [191]:
df

        Name Address  New Age
0     Sourav  Punjab       23
1  Kritartha  Gujrat       23
2     Thakur   Assam       23

In [192]:
df['Old Age']=df['New Age']-1
df

        Name Address  New Age  Old Age
0     Sourav  Punjab       23       22
1  Kritartha  Gujrat       23       22
2     Thakur   Assam       23       22

In [193]:
df.drop([0,1],axis=0)

     Name Address  New Age  Old Age
2  Thakur   Assam       23       22

In [194]:
df.drop(['New Age','Old Age'],axis=1)

        Name Address
0     Sourav  Punjab
1  Kritartha  Gujrat
2     Thakur   Assam

In [195]:
df

        Name Address  New Age  Old Age
0     Sourav  Punjab       23       22
1  Kritartha  Gujrat       23       22
2     Thakur   Assam       23       22

In [196]:
df.T

              0          1       2
Name     Sourav  Kritartha  Thakur
Address  Punjab     Gujrat   Assam
New Age      23         23      23
Old Age      22         22      22

In [197]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['Name', 'Address', 'New Age', 'Old Age'], dtype='object')]

In [198]:
df.ndim

2

In [199]:
df.dtypes

Name       object
Address    object
New Age     int64
Old Age     int64
dtype: object

In [200]:
df.shape

(3, 4)

In [201]:
df

        Name Address  New Age  Old Age
0     Sourav  Punjab       23       22
1  Kritartha  Gujrat       23       22
2     Thakur   Assam       23       22

In [202]:
df.head(2)

        Name Address  New Age  Old Age
0     Sourav  Punjab       23       22
1  Kritartha  Gujrat       23       22

In [203]:
df.tail(2)

        Name Address  New Age  Old Age
1  Kritartha  Gujrat       23       22
2     Thakur   Assam       23       22

In [204]:
df.empty

False

In [205]:
ndf={'One':pd.Series([1,2,3,4]),
                 'Two':pd.Series([10,20,30,40]),
                 'Three':pd.Series([100,200,300,400]),
                 'Four':pd.Series([1000,2000,3000,4000])}

In [206]:
ndf

{'One': 0    1
 1    2
 2    3
 3    4
 dtype: int64,
 'Two': 0    10
 1    20
 2    30
 3    40
 dtype: int64,
 'Three': 0    100
 1    200
 2    300
 3    400
 dtype: int64,
 'Four': 0    1000
 1    2000
 2    3000
 3    4000
 dtype: int64}

In [207]:
ndf=pd.DataFrame(ndf)

In [208]:
ndf

   One  Two  Three  Four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [209]:
ndf.sum()

One         10
Two        100
Three     1000
Four     10000
dtype: int64

In [210]:
ndf.mean()

One         2.5
Two        25.0
Three     250.0
Four     2500.0
dtype: float64

In [211]:
ndf.median()

One         2.5
Two        25.0
Three     250.0
Four     2500.0
dtype: float64

In [212]:
df

        Name Address  New Age  Old Age
0     Sourav  Punjab       23       22
1  Kritartha  Gujrat       23       22
2     Thakur   Assam       23       22

In [213]:
df['New Age'].mode()

0    23
Name: New Age, dtype: int64

In [214]:
ndf.var()

One      1.666667e+00
Two      1.666667e+02
Three    1.666667e+04
Four     1.666667e+06
dtype: float64

In [215]:
ndf.min()

One         1
Two        10
Three     100
Four     1000
dtype: int64

In [216]:
ndf.max()

One         4
Two        40
Three     400
Four     4000
dtype: int64

In [217]:
ndf.std()

One         1.290994
Two        12.909944
Three     129.099445
Four     1290.994449
dtype: float64

In [218]:
ndf

   One  Two  Three  Four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [219]:
ndf.describe()

            One        Two       Three         Four
count  4.000000   4.000000    4.000000     4.000000
mean   2.500000  25.000000  250.000000  2500.000000
std    1.290994  12.909944  129.099445  1290.994449
min    1.000000  10.000000  100.000000  1000.000000
25%    1.750000  17.500000  175.000000  1750.000000
50%    2.500000  25.000000  250.000000  2500.000000
75%    3.250000  32.500000  325.000000  3250.000000
max    4.000000  40.000000  400.000000  4000.000000

In [220]:
ndf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   One     4 non-null      int64
 1   Two     4 non-null      int64
 2   Three   4 non-null      int64
 3   Four    4 non-null      int64
dtypes: int64(4)
memory usage: 256.0 bytes

In [221]:
ndf

   One  Two  Three  Four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [222]:
def add_fun(i,j):
    return i+j
def sub_fun(i,j):
    return i-j

In [223]:
ndf.pipe(add_fun,10)

   One  Two  Three  Four
0   11   20    110  1010
1   12   30    210  2010
2   13   40    310  3010
3   14   50    410  4010

In [224]:
ndf.pipe(sub_fun,20)

   One  Two  Three  Four
0  -19  -10     80   980
1  -18    0    180  1980
2  -17   10    280  2980
3  -16   20    380  3980

In [225]:
def am(i):
    return i.mean()
def sq(j):
    return j**2

In [226]:
ndf.pipe(am)

One         2.5
Two        25.0
Three     250.0
Four     2500.0
dtype: float64

In [227]:
ndf.pipe(sq)

   One   Two   Three      Four
0    1   100   10000   1000000
1    4   400   40000   4000000
2    9   900   90000   9000000
3   16  1600  160000  16000000

In [228]:
import numpy as np

In [229]:
ndf.apply(np.median)

One         2.5
Two        25.0
Three     250.0
Four     2500.0
dtype: float64

In [230]:
ndf.apply(np.max)

One         4
Two        40
Three     400
Four     4000
dtype: int64

In [231]:
ndf.apply(lambda x:x.max()-x.min())

One         3
Two        30
Three     300
Four     3000
dtype: int64

In [232]:
ndf.applymap(lambda x:x+100)

   One  Two  Three  Four
0  101  110    200  1100
1  102  120    300  2100
2  103  130    400  3100
3  104  140    500  4100

In [233]:
ndf

   One  Two  Three  Four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [234]:
ndf.reindex(['one','two','three','four'])

       One  Two  Three  Four
one    NaN  NaN    NaN   NaN
two    NaN  NaN    NaN   NaN
three  NaN  NaN    NaN   NaN
four   NaN  NaN    NaN   NaN

In [235]:
df

        Name Address  New Age  Old Age
0     Sourav  Punjab       23       22
1  Kritartha  Gujrat       23       22
2     Thakur   Assam       23       22

In [236]:
df=df.reindex(columns=['New Age','Old Age','Name','Address'])

In [237]:
df

   New Age  Old Age       Name Address
0       23       22     Sourav  Punjab
1       23       22  Kritartha  Gujrat
2       23       22     Thakur   Assam

In [238]:
df.rename(columns={'Old Age':'Prev Age','Name':'name'})

   New Age  Prev Age       name Address
0       23        22     Sourav  Punjab
1       23        22  Kritartha  Gujrat
2       23        22     Thakur   Assam

In [239]:
nndf=pd.DataFrame({'one':[5,4,6,3],
      'two':[55,34,68,56],
      'three':[509,304,560,405]})

In [240]:
nndf

   one  two  three
0    5   55    509
1    4   34    304
2    6   68    560
3    3   56    405

In [241]:
nndf.sort_values(by='one')

   one  two  three
3    3   56    405
1    4   34    304
0    5   55    509
2    6   68    560

In [242]:
nndf.sort_values(by='one',ascending=False)

   one  two  three
2    6   68    560
0    5   55    509
1    4   34    304
3    3   56    405

In [243]:
nndf.sort_values(by='one',kind='mergesort')

   one  two  three
3    3   56    405
1    4   34    304
0    5   55    509
2    6   68    560

In [244]:
cricket = {'Team'   : ['India', 'India', 'Australia', 'Australia', 'SA', 'SA', 'SA', 'SA', 'NZ', 'NZ', 'NZ', 'India'],
           'Rank'   : [2, 3, 1,2, 3,4 ,1 ,1,2 , 4,1,2],
           'Year'   : [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
           'Points' : [876,801,891,815,776,784,834,824,758,691,883,782]}

cf = pd.DataFrame(cricket)
cf

         Team  Rank  Year  Points
0       India     2  2014     876
1       India     3  2015     801
2   Australia     1  2014     891
3   Australia     2  2015     815
4          SA     3  2014     776
5          SA     4  2015     784
6          SA     1  2016     834
7          SA     1  2017     824
8          NZ     2  2016     758
9          NZ     4  2014     691
10         NZ     1  2015     883
11      India     2  2017     782

In [245]:
cf.groupby('Team').groups

{'Australia': [2, 3], 'India': [0, 1, 11], 'NZ': [8, 9, 10], 'SA': [4, 5, 6, 7]}

In [246]:
cf.groupby(['Team','Year']).get_group(('Australia',2014))

        Team  Rank  Year  Points
2  Australia     1  2014     891

In [247]:
cf.groupby(['Team'])['Points'].sum().sort_values(ascending=False)

Team
SA           3218
India        2459
NZ           2332
Australia    1706
Name: Points, dtype: int64

In [248]:
groups=cf.groupby(['Team'])

In [249]:
groups['Points'].describe()

           count        mean        std    min    25%    50%    75%    max
Team
Australia    2.0  853.000000  53.740115  815.0  834.0  853.0  872.0  891.0
India        3.0  819.666667  49.702448  782.0  791.5  801.0  838.5  876.0
NZ           3.0  777.333333  97.449132  691.0  724.5  758.0  820.5  883.0
SA           4.0  804.500000  28.769196  776.0  782.0  804.0  826.5  834.0

In [250]:
cf.groupby(['Team']).filter(lambda x:len(x)==4)

  Team  Rank  Year  Points
4   SA     3  2014     776
5   SA     4  2015     784
6   SA     1  2016     834
7   SA     1  2017     824

In [251]:
cf.groupby(['Team']).filter(lambda x:len(x)==3)

     Team  Rank  Year  Points
0   India     2  2014     876
1   India     3  2015     801
8      NZ     2  2016     758
9      NZ     4  2014     691
10     NZ     1  2015     883
11  India     2  2017     782

In [252]:
df=pd.read_csv('Football.csv')

In [253]:
df.head()

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
0,Spain,La Liga,(BET),Juanmi Callejon,19,16,1849,11,6.62,0.34,48,20,2.47,1.03,2016
1,Spain,La Liga,(BAR),Antoine Griezmann,36,0,3129,16,11.86,0.36,88,41,2.67,1.24,2016
2,Spain,La Liga,(ATL),Luis Suarez,34,1,2940,28,23.21,0.75,120,57,3.88,1.84,2016
3,Spain,La Liga,(CAR),Ruben Castro,32,3,2842,13,14.06,0.47,117,42,3.91,1.40,2016
4,Spain,La Liga,(VAL),Kevin Gameiro,21,10,1745,13,10.65,0.58,50,23,2.72,1.25,2016

In [254]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 660 entries, 0 to 659
Data columns (total 15 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Country                  660 non-null    object
 1   League                   660 non-null    object
 2   Club                     660 non-null    object
 3   Player Names             660 non-null    object
 4   Matches_Played           660 non-null    int64
 5   Substitution             660 non-null    int64
 6   Mins                     660 non-null    int64
 7   Goals                    660 non-null    int64
 8   xG                       660 non-null    float64
 9   xG Per Avg Match         660 non-null    float64
 10  Shots                    660 non-null    int64
 11  OnTarget                 660 non-null    int64
 12  Shots Per Avg Match      660 non-null    float64
 13  On Target Per Avg Match  660 non-null    float64
 14  Year                     660 non-null    int64
dtypes: float64(4), int64(7), object(4)
memory usage: 77.5+ KB

In [255]:
df.describe()

,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
count,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000
mean,22.371212,3.224242,2071.416667,11.810606,10.089606,0.476167,64.177273,28.365152,2.948015,1.315652,2018.363636
std,9.754658,3.839498,900.595049,6.075315,5.724844,0.192831,34.941622,16.363149,0.914906,0.474239,1.367700
min,2.000000,0.000000,264.000000,2.000000,0.710000,0.070000,5.000000,2.000000,0.800000,0.240000,2016.000000
25%,14.000000,0.000000,1363.500000,8.000000,6.100000,0.340000,37.750000,17.000000,2.335000,0.980000,2017.000000
50%,24.000000,2.000000,2245.500000,11.000000,9.285000,0.435000,62.000000,26.000000,2.845000,1.250000,2019.000000
75%,31.000000,5.000000,2822.000000,14.000000,13.252500,0.570000,86.000000,37.000000,3.382500,1.540000,2019.000000
max,38.000000,26.000000,4177.000000,42.000000,32.540000,1.350000,208.000000,102.000000,7.200000,3.630000,2020.000000

In [256]:
df.isnull().sum()

Country                    0
League                     0
Club                       0
Player Names               0
Matches_Played             0
Substitution               0
Mins                       0
Goals                      0
xG                         0
xG Per Avg Match           0
Shots                      0
OnTarget                   0
Shots Per Avg Match        0
On Target Per Avg Match    0
Year                       0
dtype: int64

In [257]:
df['Mins'].quantile(.80)

2915.8

In [258]:
de=df.copy()
de.head(3)

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
0,Spain,La Liga,(BET),Juanmi Callejon,19,16,1849,11,6.62,0.34,48,20,2.47,1.03,2016
1,Spain,La Liga,(BAR),Antoine Griezmann,36,0,3129,16,11.86,0.36,88,41,2.67,1.24,2016
2,Spain,La Liga,(ATL),Luis Suarez,34,1,2940,28,23.21,0.75,120,57,3.88,1.84,2016

In [259]:
de['year+100']=de['Year']+100
de.head()

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year,year+100
0,Spain,La Liga,(BET),Juanmi Callejon,19,16,1849,11,6.62,0.34,48,20,2.47,1.03,2016,2116
1,Spain,La Liga,(BAR),Antoine Griezmann,36,0,3129,16,11.86,0.36,88,41,2.67,1.24,2016,2116
2,Spain,La Liga,(ATL),Luis Suarez,34,1,2940,28,23.21,0.75,120,57,3.88,1.84,2016,2116
3,Spain,La Liga,(CAR),Ruben Castro,32,3,2842,13,14.06,0.47,117,42,3.91,1.40,2016,2116
4,Spain,La Liga,(VAL),Kevin Gameiro,21,10,1745,13,10.65,0.58,50,23,2.72,1.25,2016,2116

In [260]:
df['Player Names'].value_counts()

Andrea Belotti     5
Lionel Messi       5
Luis Suarez        5
Andrej Kramaric    5
Ciro Immobile      5
                  ..
Francois Kamano    1
Lebo Mothiba       1
Gaetan Laborde     1
Falcao             1
Cody Gakpo         1
Name: Player Names, Length: 444, dtype: int64

In [261]:
df['Player Names'].nunique()

444

In [262]:
link = 'https://raw.githubusercontent.com/AshishJangra27/Data-Analysis-with-Python-GFG/main/3.%20Data%20Preprocessing%20-%20Removing%20Null%20Value%20Rows/googleplaystore.csv'

df = pd.read_csv(link)
df.head()

,App,Category,Rating,Reviews,Size,Installs,Type,Price,Content Rating,Genres,Last Updated,Current Ver,Android Ver
0,Photo Editor & Candy Camera & Grid & ScrapBook,ART_AND_DESIGN,4.1,159,19M,"10,000+",Free,0,Everyone,Art & Design,"January 7, 2018",1.0.0,4.0.3 and up
1,Coloring book moana,ART_AND_DESIGN,3.9,967,14M,"500,000+",Free,0,Everyone,Art & Design;Pretend Play,"January 15, 2018",2.0.0,4.0.3 and up
2,"U Launcher Lite FREE Live Cool Themes, Hide ...",ART_AND_DESIGN,4.7,87510,8.7M,"5,000,000+",Free,0,Everyone,Art & Design,"August 1, 2018",1.2.4,4.0.3 and up
3,Sketch - Draw & Paint,ART_AND_DESIGN,4.5,215644,25M,"50,000,000+",Free,0,Teen,Art & Design,"June 8, 2018",Varies with device,4.2 and up
4,Pixel Draw - Number Art Coloring Book,ART_AND_DESIGN,4.3,967,2.8M,"100,000+",Free,0,Everyone,Art & Design;Creativity,"June 20, 2018",1.1,4.4 and up

In [263]:
df.isnull().sum()

App                  0
Category             0
Rating            1474
Reviews              0
Size                 0
Installs             0
Type                 1
Price                0
Content Rating       1
Genres               0
Last Updated         0
Current Ver          8
Android Ver          3
dtype: int64

In [264]:
df.dropna(inplace=True,axis=0)

In [265]:
df

,App,Category,Rating,Reviews,Size,Installs,Type,Price,Content Rating,Genres,Last Updated,Current Ver,Android Ver
0,Photo Editor & Candy Camera & Grid & ScrapBook,ART_AND_DESIGN,4.1,159,19M,"10,000+",Free,0,Everyone,Art & Design,"January 7, 2018",1.0.0,4.0.3 and up
1,Coloring book moana,ART_AND_DESIGN,3.9,967,14M,"500,000+",Free,0,Everyone,Art & Design;Pretend Play,"January 15, 2018",2.0.0,4.0.3 and up
2,"U Launcher Lite FREE Live Cool Themes, Hide ...",ART_AND_DESIGN,4.7,87510,8.7M,"5,000,000+",Free,0,Everyone,Art & Design,"August 1, 2018",1.2.4,4.0.3 and up
3,Sketch - Draw & Paint,ART_AND_DESIGN,4.5,215644,25M,"50,000,000+",Free,0,Teen,Art & Design,"June 8, 2018",Varies with device,4.2 and up
4,Pixel Draw - Number Art Coloring Book,ART_AND_DESIGN,4.3,967,2.8M,"100,000+",Free,0,Everyone,Art & Design;Creativity,"June 20, 2018",1.1,4.4 and up
...,...,...,...,...,...,...,...,...,...,...,...,...,...
10834,FR Calculator,FAMILY,4.0,7,2.6M,500+,Free,0,Everyone,Education,"June 18, 2017",1.0.0,4.1 and up
10836,Sya9a Maroc - FR,FAMILY,4.5,38,53M,"5,000+",Free,0,Everyone,Education,"July 25, 2017",1.48,4.1 and up
10837,Fr. Mike Schmitz Audio Teachings,FAMILY,5.0,4,3.6M,100+,Free,0,Everyone,Education,"July 6, 2018",1.0,4.1 and up
10839,The SCP Foundation DB fr nn5n,BOOKS_AND_REFERENCE,4.5,114,Varies with device,"1,000+",Free,0,Mature 17+,Books & Reference,"January 19, 2015",Varies with device,Varies with device
10840,iHoroscope - 2018 Daily Horoscope & Astrology,LIFESTYLE,4.5,398307,19M,"10,000,000+",Free,0,Everyone,Lifestyle,"July 25, 2018",Varies with device,Varies with device

In [266]:
df.isnull().sum()

App               0
Category          0
Rating            0
Reviews           0
Size              0
Installs          0
Type              0
Price             0
Content Rating    0
Genres            0
Last Updated      0
Current Ver       0
Android Ver       0
dtype: int64

In [267]:
link = 'https://raw.githubusercontent.com/AshishJangra27/Data-Analysis-with-Python-GFG/main/3.%20Data%20Preprocessing%20-%20Removing%20Null%20Value%20Rows/googleplaystore.csv'

df = pd.read_csv(link)

print(len(df))

10841

In [268]:
df.head()

,App,Category,Rating,Reviews,Size,Installs,Type,Price,Content Rating,Genres,Last Updated,Current Ver,Android Ver
0,Photo Editor & Candy Camera & Grid & ScrapBook,ART_AND_DESIGN,4.1,159,19M,"10,000+",Free,0,Everyone,Art & Design,"January 7, 2018",1.0.0,4.0.3 and up
1,Coloring book moana,ART_AND_DESIGN,3.9,967,14M,"500,000+",Free,0,Everyone,Art & Design;Pretend Play,"January 15, 2018",2.0.0,4.0.3 and up
2,"U Launcher Lite FREE Live Cool Themes, Hide ...",ART_AND_DESIGN,4.7,87510,8.7M,"5,000,000+",Free,0,Everyone,Art & Design,"August 1, 2018",1.2.4,4.0.3 and up
3,Sketch - Draw & Paint,ART_AND_DESIGN,4.5,215644,25M,"50,000,000+",Free,0,Teen,Art & Design,"June 8, 2018",Varies with device,4.2 and up
4,Pixel Draw - Number Art Coloring Book,ART_AND_DESIGN,4.3,967,2.8M,"100,000+",Free,0,Everyone,Art & Design;Creativity,"June 20, 2018",1.1,4.4 and up

In [269]:
df.isnull().sum()

App                  0
Category             0
Rating            1474
Reviews              0
Size                 0
Installs             0
Type                 1
Price                0
Content Rating       1
Genres               0
Last Updated         0
Current Ver          8
Android Ver          3
dtype: int64

In [270]:
df['Rating']=df['Rating'].fillna(lambda x:x.mean())

In [271]:
df.isnull().sum()

App               0
Category          0
Rating            0
Reviews           0
Size              0
Installs          0
Type              1
Price             0
Content Rating    1
Genres            0
Last Updated      0
Current Ver       8
Android Ver       3
dtype: int64

In [272]:
df[['Type','Content Rating','Current Ver','Android Ver']]

       Type Content Rating         Current Ver         Android Ver
0      Free       Everyone               1.0.0        4.0.3 and up
1      Free       Everyone               2.0.0        4.0.3 and up
2      Free       Everyone               1.2.4        4.0.3 and up
3      Free           Teen  Varies with device          4.2 and up
4      Free       Everyone                 1.1          4.4 and up
...     ...            ...                 ...                 ...
10836  Free       Everyone                1.48          4.1 and up
10837  Free       Everyone                 1.0          4.1 and up
10838  Free       Everyone                 1.0          2.2 and up
10839  Free     Mature 17+  Varies with device  Varies with device
10840  Free       Everyone  Varies with device  Varies with device

[10841 rows x 4 columns]

In [273]:
df[['Type','Content Rating','Current Ver','Android Ver']]=df[['Type','Content Rating','Current Ver','Android Ver']].fillna(lambda x:x.mode())

In [274]:
df.isnull().sum()

App               0
Category          0
Rating            0
Reviews           0
Size              0
Installs          0
Type              0
Price             0
Content Rating    0
Genres            0
Last Updated      0
Current Ver       0
Android Ver       0
dtype: int64

In [275]:
df.sample(5)

,App,Category,Rating,Reviews,Size,Installs,Type,Price,Content Rating,Genres,Last Updated,Current Ver,Android Ver
8879,Riptide GP: Renegade,GAME,4.7,4328,Varies with device,"100,000+",Paid,$2.99,Everyone 10+,Racing,"June 1, 2018",1.2.1,4.1 and up
8311,Bike Racing 3D,GAME,4.2,951435,14M,"50,000,000+",Free,0,Everyone,Racing,"January 17, 2018",2.2,2.1 and up
5521,Questland: Turn Based RPG,FAMILY,4.6,31134,48M,"1,000,000+",Free,0,Everyone 10+,Role Playing,"August 2, 2018",1.10.6,4.1 and up
8838,DS-20000S,PRODUCTIVITY,1.8,12,14M,"1,000+",Free,0,Everyone,Productivity,"August 3, 2018",1.2.2,4.1 and up
253,join.me - Simple Meetings,BUSINESS,4.0,6989,Varies with device,"1,000,000+",Free,0,Everyone,Business,"July 16, 2018",4.3.0.508,4.4 and up